In [1]:
import pandas as pd
import numpy as np

## Various ways to create DataFrame 
### List to DataFrame

In [7]:
df1=pd.DataFrame([100,200,300,400,500],index=['A','B','C','D','E'],columns=['PRICE'])

In [8]:
df1

   PRICE
A    100
B    200
C    300
D    400
E    500

In [9]:
df1['PRICE'] # a particular extracted column will be displayed as series

A    100
B    200
C    300
D    400
E    500
Name: PRICE, dtype: int64

In [10]:
type(df1["PRICE"]) # when we extract any particular column then we get object as series object

pandas.core.series.Series

In [11]:
type(df1)

pandas.core.frame.DataFrame

In [4]:
# OR

In [5]:
l1=['Aaa','Bbb','Ccc','Ddd']

In [6]:
dfl1=pd.DataFrame(l1,index=[1,2,3,4])

In [8]:
dfl1

     0
1  Aaa
2  Bbb
3  Ccc
4  Ddd

In [9]:
dfl1[0]

1    Aaa
2    Bbb
3    Ccc
4    Ddd
Name: 0, dtype: object

### Nested list to DataFrame

In [10]:
nlist=[['A',15,65],['B',16,60],['C',16,75]]

In [11]:
dfstd=pd.DataFrame(nlist,index=['s1','s2','s3'],columns=['Name','Age','Avg'])

In [12]:
dfstd

   Name  Age  Avg
s1    A   15   65
s2    B   16   60
s3    C   16   75

### Series to DataFrame

In [2]:
df2=pd.Series([100,200,300,400,500])

In [3]:
pd.DataFrame(df2)

     0
0  100
1  200
2  300
3  400
4  500

### Variable values to Dataframe

In [12]:
a='AAA'
b=15
c=65

In [13]:
pd.dataFrame(a,b,c)

AttributeError: module 'pandas' has no attribute 'dataFrame'

In [14]:
pd.DataFrame([a,b,c],index=['Name','Age','Avg'],columns=['Std1'])

     Std1
Name  AAA
Age    15
Avg    65

### Scalar to DataFrame

In [22]:
pd.DataFrame(9)

ValueError: DataFrame constructor not properly called!

In [23]:
dfscalar=pd.DataFrame(9,index=[1,2,3,4,5],columns=['A','B','C'])

In [24]:
dfscalar

   A  B  C
1  9  9  9
2  9  9  9
3  9  9  9
4  9  9  9
5  9  9  9

### Numpy Array to DataFrame

In [25]:
ary1=np.random.randint(10,20,(4,6))

In [26]:
ary1

array([[13, 11, 11, 14, 18, 15],
       [14, 13, 13, 11, 17, 11],
       [10, 15, 14, 13, 19, 10],
       [14, 12, 10, 14, 14, 19]])

In [27]:
dfarray=pd.DataFrame(ary1)

In [28]:
dfarray

    0   1   2   3   4   5
0  13  11  11  14  18  15
1  14  13  13  11  17  11
2  10  15  14  13  19  10
3  14  12  10  14  14  19

In [29]:
dfarray.index

RangeIndex(start=0, stop=4, step=1)

In [30]:
dfarray.index=['A','B','C','D'] # changing index after dataframe created

In [31]:
dfarray

    0   1   2   3   4   5
A  13  11  11  14  18  15
B  14  13  13  11  17  11
C  10  15  14  13  19  10
D  14  12  10  14  14  19

In [32]:
dfarray.columns=[11,22,33,44,55,66] # Renaming the columns

In [33]:
dfarray

   11  22  33  44  55  66
A  13  11  11  14  18  15
B  14  13  13  11  17  11
C  10  15  14  13  19  10
D  14  12  10  14  14  19

In [34]:
type(dfarray)

pandas.core.frame.DataFrame

In [35]:
dfarray[22]

A    11
B    13
C    15
D    12
Name: 22, dtype: int32

In [36]:
type(dfarray[22])

pandas.core.series.Series

In [37]:
dfarray[[22]] # double square brackets

   22
A  11
B  13
C  15
D  12

In [38]:
type(dfarray[[22]])

pandas.core.frame.DataFrame

In [39]:
dfarray

   11  22  33  44  55  66
A  13  11  11  14  18  15
B  14  13  13  11  17  11
C  10  15  14  13  19  10
D  14  12  10  14  14  19

In [40]:
ary1

array([[13, 11, 11, 14, 18, 15],
       [14, 13, 13, 11, 17, 11],
       [10, 15, 14, 13, 19, 10],
       [14, 12, 10, 14, 14, 19]])

In [41]:
ary1[1,3]

11

In [42]:
dfarray

   11  22  33  44  55  66
A  13  11  11  14  18  15
B  14  13  13  11  17  11
C  10  15  14  13  19  10
D  14  12  10  14  14  19

In [43]:
dfarray(['B',44])

TypeError: 'DataFrame' object is not callable

In [44]:
dfarray[44]["B"] # for extracting a value fisrt preference is given to column

11

In [45]:
dfarray[44][1]

11

In [46]:
pd.Series([1,2,3,4,5,6,7,8,9])

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [47]:
s1=pd.Series(np.arange(1,10))

In [48]:
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32

In [49]:
pd.DataFrame(s1)

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

### Dictionary to DataFrame

In [50]:
d1={
    'Name':['A','B','C','D','E'],
    "Class":[10,12,11,10,12],
    "Eng":[88,76,69,90,82]
}

In [51]:
d1

{'Name': ['A', 'B', 'C', 'D', 'E'],
 'Class': [10, 12, 11, 10, 12],
 'Eng': [88, 76, 69, 90, 82]}

In [52]:
pd.DataFrame([d1])

              Name                 Class                   Eng
0  [A, B, C, D, E]  [10, 12, 11, 10, 12]  [88, 76, 69, 90, 82]

In [53]:
pd.DataFrame(d1)

  Name  Class  Eng
0    A     10   88
1    B     12   76
2    C     11   69
3    D     10   90
4    E     12   82

In [54]:
dfstd=pd.DataFrame(d1,index=['s1','s2','s3','s4','s5'])

In [55]:
dfstd

   Name  Class  Eng
s1    A     10   88
s2    B     12   76
s3    C     11   69
s4    D     10   90
s5    E     12   82

In [56]:
pd.DataFrame(d1,columns=['Stdname','Stdclass','Stdeng'])

Empty DataFrame
Columns: [Stdname, Stdclass, Stdeng]
Index: []

In [57]:
pd.DataFrame(d1,columns=['Name','Stdclass','Stdeng'])

  Name Stdclass Stdeng
0    A      NaN    NaN
1    B      NaN    NaN
2    C      NaN    NaN
3    D      NaN    NaN
4    E      NaN    NaN

In [58]:
dfstd.columns=['SName','SClass','SEng'] # Renaming columns

In [59]:
dfstd

   SName  SClass  SEng
s1     A      10    88
s2     B      12    76
s3     C      11    69
s4     D      10    90
s5     E      12    82

In [88]:
dfstd=dfstd[['SEng','SClass','SName']] # Shuffeling of columns

In [61]:
dfstd

    SEng  SClass SName
s1    88      10     A
s2    76      12     B
s3    69      11     C
s4    90      10     D
s5    82      12     E

In [62]:
d1

{'Name': ['A', 'B', 'C', 'D', 'E'],
 'Class': [10, 12, 11, 10, 12],
 'Eng': [88, 76, 69, 90, 82]}

In [63]:
d1['Maths']=[90,67,45,78,87]

In [64]:
d1

{'Name': ['A', 'B', 'C', 'D', 'E'],
 'Class': [10, 12, 11, 10, 12],
 'Eng': [88, 76, 69, 90, 82],
 'Maths': [90, 67, 45, 78, 87]}

In [65]:
dfstd

    SEng  SClass SName
s1    88      10     A
s2    76      12     B
s3    69      11     C
s4    90      10     D
s5    82      12     E

In [66]:
dfstd['SEng']

s1    88
s2    76
s3    69
s4    90
s5    82
Name: SEng, dtype: int64

In [67]:
dfstd['Computer']=[90,89,78,69,57]

C:\Users\User\AppData\Local\Temp/ipykernel_10220/519544484.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfstd['Computer']=[90,89,78,69,57]

In [68]:
dfstd

    SEng  SClass SName  Computer
s1    88      10     A        90
s2    76      12     B        89
s3    69      11     C        78
s4    90      10     D        69
s5    82      12     E        57

In [69]:
dfstd['Science']=[67,65,88,66,95]

C:\Users\User\AppData\Local\Temp/ipykernel_10220/3444822570.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfstd['Science']=[67,65,88,66,95]

In [70]:
dfstd

    SEng  SClass SName  Computer  Science
s1    88      10     A        90       67
s2    76      12     B        89       65
s3    69      11     C        78       88
s4    90      10     D        69       66
s5    82      12     E        57       95

In [71]:
dfstd['SEng']

s1    88
s2    76
s3    69
s4    90
s5    82
Name: SEng, dtype: int64

In [72]:
dfstd['Computer']

s1    90
s2    89
s3    78
s4    69
s5    57
Name: Computer, dtype: int64

In [73]:
dfstd['Total']=dfstd['SEng']+dfstd['Computer']+dfstd['Science']

C:\Users\User\AppData\Local\Temp/ipykernel_10220/279104142.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfstd['Total']=dfstd['SEng']+dfstd['Computer']+dfstd['Science']

In [74]:
dfstd

    SEng  SClass SName  Computer  Science  Total
s1    88      10     A        90       67    245
s2    76      12     B        89       65    230
s3    69      11     C        78       88    235
s4    90      10     D        69       66    225
s5    82      12     E        57       95    234

In [75]:
import warnings
warnings.filterwarnings('ignore')

In [76]:
dfstd['Avg']=dfstd['Total']/3

In [77]:
dfstd

    SEng  SClass SName  Computer  Science  Total        Avg
s1    88      10     A        90       67    245  81.666667
s2    76      12     B        89       65    230  76.666667
s3    69      11     C        78       88    235  78.333333
s4    90      10     D        69       66    225  75.000000
s5    82      12     E        57       95    234  78.000000

In [78]:
dfstd['Avg']

s1    81.666667
s2    76.666667
s3    78.333333
s4    75.000000
s5    78.000000
Name: Avg, dtype: float64

In [79]:
np.round(dfstd['Avg'],2)

s1    81.67
s2    76.67
s3    78.33
s4    75.00
s5    78.00
Name: Avg, dtype: float64

In [80]:
dfstd

    SEng  SClass SName  Computer  Science  Total        Avg
s1    88      10     A        90       67    245  81.666667
s2    76      12     B        89       65    230  76.666667
s3    69      11     C        78       88    235  78.333333
s4    90      10     D        69       66    225  75.000000
s5    82      12     E        57       95    234  78.000000

In [81]:
dfstd['Avg']=np.round(dfstd['Avg'],2)

In [82]:
dfstd

    SEng  SClass SName  Computer  Science  Total    Avg
s1    88      10     A        90       67    245  81.67
s2    76      12     B        89       65    230  76.67
s3    69      11     C        78       88    235  78.33
s4    90      10     D        69       66    225  75.00
s5    82      12     E        57       95    234  78.00

In [83]:
dfstd['Avg']

s1    81.67
s2    76.67
s3    78.33
s4    75.00
s5    78.00
Name: Avg, dtype: float64

In [84]:
dfstd['Avg'][0]

81.67

In [85]:
dfstd['Grade']=dfstd['Avg'].map(lambda x:'A' if x>80 else ( 'B'if x>75 else 'C'))

In [86]:
dfstd

    SEng  SClass SName  Computer  Science  Total    Avg Grade
s1    88      10     A        90       67    245  81.67     A
s2    76      12     B        89       65    230  76.67     B
s3    69      11     C        78       88    235  78.33     B
s4    90      10     D        69       66    225  75.00     C
s5    82      12     E        57       95    234  78.00     B

ValueError: Length of values (1) does not match length of index (5)